GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
}

/*生成09发送的数据包*/
void vdr_09_get_ready( MYTIME start, MYTIME end, uint16_t totalrecord )
{
	uint32_t			addr;
	JT808_TX_NODEDATA	*pnodedata;
	VDR_USERDATA		*puserdata;
	uint32_t			i;
	uint16_t			rec_count = 0; /*找到的记录数*/
	uint8_t				buf[126 * 4];

	uint8_t				sector;
	uint8_t				index;

	uint8_t				sector_from = 0xFF;
	uint8_t				index_from;
	uint32_t			time_from = 0xFFFFFFFF;

	uint8_t				sector_to;
	uint8_t				index_to;
	uint32_t			time_to = 0xFFFFFFFF;

	MYTIME				mytime;

	/*从当前位置开始逆序查找*/
	start	&= 0xFFFFF000;                                  /*忽略分秒*/
	end		&= 0xFFFFF000;

	rt_kprintf( "%d>开始遍历数据\r\n", rt_tick_get( ) );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );

	sector	= vdr_09_sect;                                  /*从当前位置开始查找*/
	index	= 5;
	for( i = 0; i < VDR_09_SECTORS; i++ )                   /*就是一个计数*/
	{
		addr = VDR_09_START + sector * 4096 + index * 680;  /*找到每个小时头*/
		sst25_read( addr, buf, 4 );
		mytime = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
		if( ( mytime >= start ) && ( mytime <= end ) )      /*在有效时间段内*/
		{
			rec_count++;
			if( rec_count >= totalrecord )                  /*收到足够的记录数*/
			{
				break;
			}
			if( time_from == 0xFFFFFFFF )                   /*第一个找到的就是最近的*/
			{
				sector_from = sector;
				index_from	= index;
			}
			if( mytime <= time_to )
			{
				sector_to	= sector;
				index_to	= index;
			}
		}

		if( index == 0 )
		{
			index = 6; /*下面做了递减*/
			if( sector == 0 )
			{
				sector = VDR_09_SECTORS;
			}
			sector--;
		}
		index--;
	}
	rt_sem_release( &sem_dataflash );

	rt_kprintf( "%d>09遍历结束(%d条) FROM %d:%d TO %08x\r\n", rt_tick_get( ), rec_count, sector_from, index_from, sector_to, index_to );

	if( rec_count == 0 )
	{
		return;
	}
	puserdata = rt_malloc( sizeof( VDR_USERDATA ) );
	if( puserdata == RT_NULL )
	{
		return;
	}
	puserdata->record_total		= rec_count;
	puserdata->record_remain	= rec_count;

	puserdata->sector_from	= sector_from;
	puserdata->sector_to	= sector_to;

	puserdata->index_from	= index_from;
	puserdata->index_to		= index_to;

	puserdata->sector	= sector_from;
	puserdata->index	= index_from;

	puserdata->packet_total = ( rec_count + 3 ) / 4; /*每四条记录形成一包*/
	puserdata->packet_curr	= 0;

	pnodedata = node_begin( 1, MULTI, 0x0700, 0xF000, 666 + 7 );
	if( pnodedata == RT_NULL )
	{
		rt_free( puserdata );
		puserdata = RT_NULL;
		rt_kprintf( "无法分配\r\n" );
	}
	pnodedata->packet_num		= rec_count;
	pnodedata->packet_no		= 0;
	pnodedata->user_para		= puserdata;
	pnodedata->cb_tx_timeout	= vdr_09_tx_timeout;
	pnodedata->cb_tx_response	= vdr_09_tx_response;
	vdr_09_fill_data( pnodedata );
	node_end( pnodedata );
}

FINSH_FUNCTION_EXPORT_ALIAS( vdr_09_get_ready, get_09, get_09_data );


/*
   事故疑点记录
*/
void vdr_10_init( void )
{
	uint32_t	addr, addr_max = 0xFFFFFFFF;
	uint8_t		find = 0;
	uint8_t		buf[32];
	uint32_t	mytime_curr		= 0;
	uint32_t	mytime_vdr_10	= 0;

	uint16_t	sector	= 0;
	uint8_t		count	= 0;

	for( vdr_10_sect = 0; vdr_10_sect < VDR_10_SECTORS; vdr_10_sect++ )
	{
		sst25_erase_4k( VDR_10_START + vdr_10_sect * 4096 );
	}
	for( vdr_10_sect = 0; vdr_10_sect < VDR_10_SECTORS; vdr_10_sect++ )
	{
		addr = VDR_10_START + vdr_10_sect * 4096;
		for( count = 0; count < 16; count++ )                                                /*每扇区6条记录*/
		{
			sst25_read( addr, buf, 4 );
			mytime_curr = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];   /*前4个字节代表时间*/
			if( mytime_curr != 0xFFFFFFFF )                                                 /*是有效记录*/
			{
				if( mytime_curr >= mytime_vdr_10 )
				{
					vdr_10_time		= mytime_curr;
					vdr_10_index	= count;
				}
			}
			addr += 256;
		}
	}
	rt_kprintf( "%d>vdr_10 sect=%08x time=%08x index=%d\r\n", rt_tick_get( ), vdr_10_sect, vdr_10_time, vdr_10_index );
}

/*
234 byte
这个不是秒单次触发的，而是车辆停驶产生的
 */
void vdr_10_put( MYTIME datetime )
{
	uint8_t		buf[16];
	uint32_t	i;
	uint32_t	addr;
	uint8_t		minute;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
		vdr_09_index++;                                             /*要写入新的小时记录每680字节*/
		if( vdr_09_index > 5 )                                      /*每个sector存6个小时 0-5,越过一个扇区*/
		{
			vdr_09_index = 0;
			vdr_09_sect++;
			if( vdr_09_sect >= VDR_09_SECTORS )
			{
				vdr_09_sect = 0;
			}
			addr = VDR_09_START + vdr_09_sect * 4096;
			sst25_erase_4k( addr );
		}

		addr = VDR_09_START + vdr_09_sect * 4096 + vdr_09_index * 680;  /*每扇区680字节*/
		PACK_INT( buf, ( datetime & 0xFFFFF000 ) );                     /*写入新的记录头*/
		buf[4]	= HEX2BCD( YEAR( datetime ) );
		buf[5]	= HEX2BCD( MONTH( datetime ) );
		buf[6]	= HEX2BCD( DAY( datetime ) );
		buf[7]	= HEX2BCD( HOUR( datetime ) );
		buf[8]	= 0;
		buf[9]	= 0;
		sst25_write_through( addr, buf, 10 );

	vdr_10_time = datetime;
	rt_sem_release( &sem_dataflash );
	rt_kprintf( "%d>save 10 data addr=%08x\r\n", rt_tick_get( ), addr );
}

/*读取数据*/
uint8_t vdr_10_fill_data( JT808_TX_NODEDATA *pnodedata )
{
	uint32_t		i, count = 0;
	uint8_t			*pdata_body;
	uint8_t			*pdata_head;
	uint8_t			*pdata;
	VDR_USERDATA	* puserdata;
	uint32_t		addr;
	//uint8_t			buf[666+7];
	MYTIME			mytime;
	uint8_t			fcs				= 0;
	uint16_t		read_data_size	= 0;

	puserdata = (VDR_USERDATA* )( pnodedata->user_para );   /*指向用户数据区*/
	if( puserdata->record_remain == 0 )                     /*已经发送完数据*/
	{
		return 0;
	}
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );  /*准备获取数据*/

	if( pnodedata->multipacket )
	{
		pdata_body = pnodedata->tag_data + 16;
	}else
	{
		pdata_body = pnodedata->tag_data + 12;
	}
	addr	= puserdata->addr;                                                      /*从当前地址开始倒序读,每次4个record*/
	pdata	= pdata_body;
	/*获取数据*/

	addr = VDR_09_START + puserdata->sector * 4096 + puserdata->index * 680 + 4;    /*开始4字节为自己的时间*/
	sst25_read( addr, pdata + 6, 666 );                                             /*开始6个字节的55 7A。。。。*/
	rt_sem_release( &sem_dataflash );

	/*整理一下数据,无效的位置信息填写0x7FFFFFFF*/
	pdata = pdata_body + 6 + 6;                                                    /*跳过开始的6字节55 7A和BCD时间头*/
	for( i = 0; i < 660; i += 11 )
	{
		if( pdata[i] == 0xff )
		{
			pdata[i]		= 0x7F;
			pdata[i + 4]	= 0x7F;
		}
	}

	/*指向下一个要读的sect,index*/
	puserdata->record_remain--;

	if( puserdata->index == 0 )
	{
		if( puserdata->sector == 0 )
		{
			puserdata->sector = VDR_09_SECTORS;
		}
		puserdata->sector--;
		puserdata->index = 6;
	}
	puserdata->index--;

